In [2]:
import pandas as pd

In [3]:
df  = pd.read_csv('online_retail.csv')

In [4]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [5]:
df.drop(['InvoiceNo' , 'StockCode' , 'Description'  , 'CustomerID' ] , axis =1 , inplace = True)

In [6]:
df.isnull().sum()

Quantity       0
InvoiceDate    0
UnitPrice      0
Country        0
dtype: int64

In [7]:
df.head()

   Quantity          InvoiceDate  UnitPrice         Country
0         6  2010-12-01 08:26:00       2.55  United Kingdom
1         6  2010-12-01 08:26:00       3.39  United Kingdom
2         8  2010-12-01 08:26:00       2.75  United Kingdom
3         6  2010-12-01 08:26:00       3.39  United Kingdom
4         6  2010-12-01 08:26:00       3.39  United Kingdom

In [8]:
df['InvoiceDate'] = pd.to_datetime(df['InvoiceDate'])

In [9]:
df['InvoiceDate'].head()

0   2010-12-01 08:26:00
1   2010-12-01 08:26:00
2   2010-12-01 08:26:00
3   2010-12-01 08:26:00
4   2010-12-01 08:26:00
Name: InvoiceDate, dtype: datetime64[ns]

In [10]:
df['day'] = df['InvoiceDate'].dt.day
df['month'] = df['InvoiceDate'].dt.month
df['year'] = df['InvoiceDate'].dt.year

In [11]:
df['year'].value_counts().sort_index()

year
2010     42481
2011    499428
Name: count, dtype: int64

In [12]:
df.drop('InvoiceDate' , axis =1 , inplace = True)

In [13]:
df.head()

   Quantity  UnitPrice         Country  day  month  year
0         6       2.55  United Kingdom    1     12  2010
1         6       3.39  United Kingdom    1     12  2010
2         8       2.75  United Kingdom    1     12  2010
3         6       3.39  United Kingdom    1     12  2010
4         6       3.39  United Kingdom    1     12  2010

In [14]:
len(df['Country'].value_counts())

38

In [15]:
df['Country'] = df['Country'].str.replace(' ' , '_')

In [16]:
df['Country'].value_counts()

Country
United_Kingdom          495478
Germany                   9495
France                    8557
EIRE                      8196
Spain                     2533
Netherlands               2371
Belgium                   2069
Switzerland               2002
Portugal                  1519
Australia                 1259
Norway                    1086
Italy                      803
Channel_Islands            758
Finland                    695
Cyprus                     622
Sweden                     462
Unspecified                446
Austria                    401
Denmark                    389
Japan                      358
Poland                     341
Israel                     297
USA                        291
Hong_Kong                  288
Singapore                  229
Iceland                    182
Canada                     151
Greece                     146
Malta                      127
United_Arab_Emirates        68
European_Community          61
RSA                         58
Lebanon                     45
Lithuania                   35
Brazil                      32
Czech_Republic              30
Bahrain                     19
Saudi_Arabia                10
Name: count, dtype: int64

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Quantity   541909 non-null  int64
 1   UnitPrice  541909 non-null  float64
 2   Country    541909 non-null  object
 3   day        541909 non-null  int32
 4   month      541909 non-null  int32
 5   year       541909 non-null  int32
dtypes: float64(1), int32(3), int64(1), object(1)
memory usage: 18.6+ MB

In [18]:
df.head()

   Quantity  UnitPrice         Country  day  month  year
0         6       2.55  United_Kingdom    1     12  2010
1         6       3.39  United_Kingdom    1     12  2010
2         8       2.75  United_Kingdom    1     12  2010
3         6       3.39  United_Kingdom    1     12  2010
4         6       3.39  United_Kingdom    1     12  2010

In [19]:
from sklearn.preprocessing import *

In [20]:
ol = OrdinalEncoder(handle_unknown = 'use_encoded_value' , unknown_value = -1)

In [21]:
new_df = df.copy()

In [22]:
new_df['Country'] = ol.fit_transform(new_df[['Country']]).astype(int)

In [23]:
new_df.head()

   Quantity  UnitPrice  Country  day  month  year
0         6       2.55       36    1     12  2010
1         6       3.39       36    1     12  2010
2         8       2.75       36    1     12  2010
3         6       3.39       36    1     12  2010
4         6       3.39       36    1     12  2010

In [24]:
new_df = new_df.sample(n = 5000 , random_state = 42).reset_index(drop = True)

In [25]:
x = new_df

In [26]:
from sklearn.cluster import KMeans

In [27]:
wcss = []

for i in range(1 , 11):
    
    k1 = KMeans(n_clusters = i , random_state = 42)
    
    k1.fit(x)
    
    wcss.append(k1.inertia_)

In [28]:
wcss

[19223225.853404608,
 7408042.124853998,
 5182851.552281371,
 4795489.91223137,
 4191015.444947039,
 2357201.8127304157,
 1772393.4218500396,
 1450216.5219096767,
 1240579.7367599977,
 1170374.467552616]

In [29]:
from kneed import KneeLocator

In [30]:
KneeLocator(range(1 , 11) , wcss , direction = 'decreasing' , curve = 'convex').elbow

np.int64(3)

In [31]:
n = 3

In [32]:
k_final = KMeans(n_clusters = n , random_state = 42)

y_pred= k_final.fit_predict(x)

In [33]:
from sklearn.metrics import silhouette_score

In [34]:
silhouette_score(x , y_pred)

0.9324947074236503

In [35]:
new_df['Cluster'] = y_pred

In [36]:
new_df.head()

   Quantity  UnitPrice  Country  day  month  year  Cluster
0        24       0.85       36    1      6  2011        0
1         4       6.95       36   27      5  2011        0
2         4       0.65       36   21      4  2011        0
3         3       1.95       36   16     11  2011        0
4         2       9.95       36   10      3  2011        0

In [37]:
from sklearn.compose import ColumnTransformer

In [42]:
df.isnull().sum()

Quantity     0
UnitPrice    0
Country      0
day          0
month        0
year         0
dtype: int64

In [43]:
df.shape

(541909, 6)

In [44]:
df = df.sample(n = 5000 , random_state = 42).reset_index(drop = True)

In [45]:
df.head()

   Quantity  UnitPrice         Country  day  month  year
0        24       0.85  United_Kingdom    1      6  2011
1         4       6.95  United_Kingdom   27      5  2011
2         4       0.65  United_Kingdom   21      4  2011
3         3       1.95  United_Kingdom   16     11  2011
4         2       9.95  United_Kingdom   10      3  2011

In [85]:
ct1 = ColumnTransformer(
    transformers = [
        ('ct1_Country' , OrdinalEncoder(handle_unknown= 'use_encoded_value' , unknown_value = -1) , ['Country']) , 
        ('ct1_year' , OrdinalEncoder(handle_unknown= 'use_encoded_value' , unknown_value = -1) , ['year']) , 
        ] , 
    remainder = 'passthrough'
)

In [102]:
ct2 = KMeans(n_clusters  = 3 , random_state = 42)

In [103]:
from sklearn.pipeline import Pipeline

In [104]:
pipe = Pipeline([
    ('p1' , ct1)  , 
    ('p2' , ct2)  , 
])

In [105]:
X = df.copy()

In [106]:
y_pred = pipe.fit_predict(X)

In [107]:
X_transformed = pipe.named_steps['p1'].transform(X)

In [108]:
silhouette_score(X_transformed, y_pred)

0.9334535267707182

In [109]:
import joblib

joblib.dump(pipe , 'uci_retail_cluster.pkl')

['uci_retail_cluster.pkl']

In [110]:
df.head()

   Quantity  UnitPrice         Country  day  month  year
0        24       0.85  United_Kingdom    1      6  2011
1         4       6.95  United_Kingdom   27      5  2011
2         4       0.65  United_Kingdom   21      4  2011
3         3       1.95  United_Kingdom   16     11  2011
4         2       9.95  United_Kingdom   10      3  2011

# Taking the Classes out from the columns

In [1]:
counts = df['Country'].value_counts()

# Get the index (model names), wrap in quotes, and join by comma
quoted_models = ", ".join([f'"{m}"' for m in counts.index])
print(quoted_models)

NameError: name 'df' is not defined